In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
a = (1,2,3,4,5,6)

b = ["One", "Two", "Three", "Four", "Five", "Six"]

x = pd.Series(data= b)
x

0      One
1      Two
2    Three
3     Four
4     Five
5      Six
dtype: object

In [4]:
z = pd.Series(data = b, index=a)
z

1      One
2      Two
3    Three
4     Four
5     Five
6      Six
dtype: object

In [5]:
y = pd.Series(data = b, index = a, dtype=str)
y

1      One
2      Two
3    Three
4     Four
5     Five
6      Six
dtype: object

In [6]:
a = [1,2,3,4]
b = ("I", "II", "III", "IV")
s = pd.Series(data = a, index = b, dtype=int)
s

I      1
II     2
III    3
IV     4
dtype: int32

In [7]:
s.index

Index(['I', 'II', 'III', 'IV'], dtype='object')

In [8]:
s["III"]

3

In [9]:
s["I"]

1

In [10]:
s["II"]

2

In [12]:
s["IV"]

4

In [13]:
data = pd.Series([1,2,3,4.6])
data

0    1.0
1    2.0
2    3.0
3    4.6
dtype: float64

In [14]:
data[::-1]

3    4.6
2    3.0
1    2.0
0    1.0
dtype: float64

In [15]:
data[-2]

KeyError: -2

In [16]:
a = [1,2,3,4,5]

In [19]:
a=[-2]

In [20]:
data[2:4]

2    3.0
3    4.6
dtype: float64

In [25]:
emp = {"A":5, "B":9, "C":15}
details = pd.Series(emp)
details

A     5
B     9
C    15
dtype: int64

In [27]:
age = {"Ram":19, "Bob":23, "Cam":21}

s = pd.Series(data=age, index=["Bob", "Ram", "Cam", "Hello"])
s

Bob      23.0
Ram      19.0
Cam      21.0
Hello     NaN
dtype: float64

In [29]:
population_dict = {
    "California":354175,
    "Texas":451783,
    "New York":417524,
    "Florida":652741,
    "Florida":421785,
    "Illinois":954712,
    "Illinois":654728}
population_series = pd.Series(population_dict)
population_series

California    354175
Texas         451783
New York      417524
Florida       421785
Illinois      654728
dtype: int64

In [33]:
population_series["Texas":"Illinois"]

Texas       451783
New York    417524
Florida     421785
Illinois    654728
dtype: int64

In [34]:
population_dict.keys()

dict_keys(['California', 'Texas', 'New York', 'Florida', 'Illinois'])

In [37]:
population_dict.values()

dict_values([354175, 451783, 417524, 421785, 654728])

In [39]:
population_series["New York"]

417524

In [41]:
pd.Series([2,3,4,5,6,4,12,87,5,4,12,3,6,5])

0      2
1      3
2      4
3      5
4      6
5      4
6     12
7     87
8      5
9      4
10    12
11     3
12     6
13     5
dtype: int64

In [43]:
area_dict = {"California":451278,
             "Texas":451274,
             "New York":371584,
             "Florida":451784,
             "Illinois":324817}
area_series = pd.Series(area_dict)
area_series

California    451278
Texas         451274
New York      371584
Florida       451784
Illinois      324817
dtype: int64

In [49]:
states = pd.DataFrame({"Population" : population_series, "Area" : area_series})
states

            Population    Area
California      354175  451278
Texas           451783  451274
New York        417524  371584
Florida         421785  451784
Illinois        654728  324817

In [51]:
data = [["A", 25,45,31],["B", 84,65,69],["C", 78," ",98],["D"," ",78,99]]
stu = pd.DataFrame(data, columns=["Name", "Maths", "Phy", "Chem"], index=[1,2,3,4])
stu

  Name Maths Phy  Chem
1    A    25  45    31
2    B    84  65    69
3    C    78        98
4    D        78    99

In [52]:
stu["Phy"]

1    45
2    65
3
4    78
Name: Phy, dtype: object

In [53]:
stu["Chem"]

1    31
2    69
3    98
4    99
Name: Chem, dtype: int64

In [54]:
stu["Maths"]

1    25
2    84
3    78
4
Name: Maths, dtype: object

In [55]:
 type(stu)

pandas.core.frame.DataFrame

In [56]:
type(stu["Phy"])

pandas.core.series.Series

In [57]:
type(stu["Maths"])

pandas.core.series.Series

In [58]:
stu["Phy", "Maths"]

KeyError: ('Phy', 'Maths')

In [59]:
stu[["Phy", "Chem", "Maths"]]

  Phy  Chem Maths
1  45    31    25
2  65    69    84
3        98    78
4  78    99

In [60]:
stu["Name"]

1    A
2    B
3    C
4    D
Name: Name, dtype: object

In [61]:
stu["Phy"]

1    45
2    65
3
4    78
Name: Phy, dtype: object

In [62]:
stu.replace(" ",0)

  Name  Maths  Phy  Chem
1    A     25   45    31
2    B     84   65    69
3    C     78    0    98
4    D      0   78    99

In [70]:
d = {"Chem" : pd.Series([80,40,50,45,78,41,25,68,74], index=["Raj", "Ram", "Asa", "Pi", "Chi", "Ru", "Sita", "Ria", "Gita"]),
    "Maths" : pd.Series([45,15,47,85,64,12,54], index=["Raj", "Ram", "Asa", "Pi", "Chi", "Ru", "Ria"]),
    "Phy" : pd.Series([68,74,45,87,35,49], index=["Raj", "Ram", "Asa", "Pi","Ria", "Gita"])}
exam = pd.DataFrame(d)
exam1 = exam.copy()
exam1

      Chem  Maths   Phy
Asa     50   47.0  45.0
Chi     78   64.0   NaN
Gita    74    NaN  49.0
Pi      45   85.0  87.0
Raj     80   45.0  68.0
Ram     40   15.0  74.0
Ria     68   54.0  35.0
Ru      41   12.0   NaN
Sita    25    NaN   NaN

In [71]:
print("Adding a new column using the existing columns in DataFrame:")
exam1["Total"] = exam1["Chem"]+exam1["Maths"]+exam1["Phy"]
exam1

Adding a new column using the existing columns in DataFrame:

      Chem  Maths   Phy  Total
Asa     50   47.0  45.0  142.0
Chi     78   64.0   NaN    NaN
Gita    74    NaN  49.0    NaN
Pi      45   85.0  87.0  217.0
Raj     80   45.0  68.0  193.0
Ram     40   15.0  74.0  129.0
Ria     68   54.0  35.0  157.0
Ru      41   12.0   NaN    NaN
Sita    25    NaN   NaN    NaN

In [72]:
exam1.isnull().sum()

Chem     0
Maths    2
Phy      3
Total    4
dtype: int64

In [73]:
exam1.fillna(0)

      Chem  Maths   Phy  Total
Asa     50   47.0  45.0  142.0
Chi     78   64.0   0.0    0.0
Gita    74    0.0  49.0    0.0
Pi      45   85.0  87.0  217.0
Raj     80   45.0  68.0  193.0
Ram     40   15.0  74.0  129.0
Ria     68   54.0  35.0  157.0
Ru      41   12.0   0.0    0.0
Sita    25    0.0   0.0    0.0

In [74]:
exam1["Avg"] = (exam1["Maths"] + exam1["Phy"] + exam1["Chem"])/3
exam1

      Chem  Maths   Phy  Total        Avg
Asa     50   47.0  45.0  142.0  47.333333
Chi     78   64.0   NaN    NaN        NaN
Gita    74    NaN  49.0    NaN        NaN
Pi      45   85.0  87.0  217.0  72.333333
Raj     80   45.0  68.0  193.0  64.333333
Ram     40   15.0  74.0  129.0  43.000000
Ria     68   54.0  35.0  157.0  52.333333
Ru      41   12.0   NaN    NaN        NaN
Sita    25    NaN   NaN    NaN        NaN

In [77]:
a = exam1["Maths"].median()
a
exam1["Maths"] = exam1["Maths"].fillna(a)

In [78]:
exam1

      Chem  Maths   Phy  Total        Avg
Asa     50   47.0  45.0  142.0  47.333333
Chi     78   64.0   NaN    NaN        NaN
Gita    74   47.0  49.0    NaN        NaN
Pi      45   85.0  87.0  217.0  72.333333
Raj     80   45.0  68.0  193.0  64.333333
Ram     40   15.0  74.0  129.0  43.000000
Ria     68   54.0  35.0  157.0  52.333333
Ru      41   12.0   NaN    NaN        NaN
Sita    25   47.0   NaN    NaN        NaN

In [79]:
exam1["Chem"].median()

50.0

In [80]:
b = exam1["Phy"].median()
b
exam1["Phy"] = exam1["Phy"].fillna(b)

exam1

      Chem  Maths   Phy  Total        Avg
Asa     50   47.0  45.0  142.0  47.333333
Chi     78   64.0  58.5    NaN        NaN
Gita    74   47.0  49.0    NaN        NaN
Pi      45   85.0  87.0  217.0  72.333333
Raj     80   45.0  68.0  193.0  64.333333
Ram     40   15.0  74.0  129.0  43.000000
Ria     68   54.0  35.0  157.0  52.333333
Ru      41   12.0  58.5    NaN        NaN
Sita    25   47.0  58.5    NaN        NaN

In [81]:
exam1["Total_Cleaned"] = exam1["Maths"]+exam1["Phy"]+exam1["Chem"]
exam1

      Chem  Maths   Phy  Total        Avg  Total_Cleaned
Asa     50   47.0  45.0  142.0  47.333333          142.0
Chi     78   64.0  58.5    NaN        NaN          200.5
Gita    74   47.0  49.0    NaN        NaN          170.0
Pi      45   85.0  87.0  217.0  72.333333          217.0
Raj     80   45.0  68.0  193.0  64.333333          193.0
Ram     40   15.0  74.0  129.0  43.000000          129.0
Ria     68   54.0  35.0  157.0  52.333333          157.0
Ru      41   12.0  58.5    NaN        NaN          111.5
Sita    25   47.0  58.5    NaN        NaN          130.5

In [82]:
exam1
exam1= exam1.dropna()

In [83]:
exam1

     Chem  Maths   Phy  Total        Avg  Total_Cleaned
Asa    50   47.0  45.0  142.0  47.333333          142.0
Pi     45   85.0  87.0  217.0  72.333333          217.0
Raj    80   45.0  68.0  193.0  64.333333          193.0
Ram    40   15.0  74.0  129.0  43.000000          129.0
Ria    68   54.0  35.0  157.0  52.333333          157.0

In [87]:
exam1.drop(["Total"], axis = 1 )

     Chem  Maths   Phy        Avg  Total_Cleaned
Asa    50   47.0  45.0  47.333333          142.0
Pi     45   85.0  87.0  72.333333          217.0
Raj    80   45.0  68.0  64.333333          193.0
Ram    40   15.0  74.0  43.000000          129.0
Ria    68   54.0  35.0  52.333333          157.0

In [88]:
exam1.drop(["Avg"], axis = 1)

     Chem  Maths   Phy  Total  Total_Cleaned
Asa    50   47.0  45.0  142.0          142.0
Pi     45   85.0  87.0  217.0          217.0
Raj    80   45.0  68.0  193.0          193.0
Ram    40   15.0  74.0  129.0          129.0
Ria    68   54.0  35.0  157.0          157.0

In [89]:
exam1

     Chem  Maths   Phy  Total        Avg  Total_Cleaned
Asa    50   47.0  45.0  142.0  47.333333          142.0
Pi     45   85.0  87.0  217.0  72.333333          217.0
Raj    80   45.0  68.0  193.0  64.333333          193.0
Ram    40   15.0  74.0  129.0  43.000000          129.0
Ria    68   54.0  35.0  157.0  52.333333          157.0

In [90]:
exam1.drop(["Total"], axis = 1, inplace = True)

C:\Users\Parag\AppData\Local\Temp\ipykernel_2348\2016675746.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exam1.drop(["Total"], axis = 1, inplace = True)

In [91]:
exam1

     Chem  Maths   Phy        Avg  Total_Cleaned
Asa    50   47.0  45.0  47.333333          142.0
Pi     45   85.0  87.0  72.333333          217.0
Raj    80   45.0  68.0  64.333333          193.0
Ram    40   15.0  74.0  43.000000          129.0
Ria    68   54.0  35.0  52.333333          157.0

In [96]:
df = pd.DataFrame({"one":[10,20,30,40,50, "ABC"], "Age":[-19,1,30,40,50,60]})
df

   one  Age
0   10  -19
1   20    1
2   30   30
3   40   40
4   50   50
5  ABC   60

In [97]:
df_cleaned = df.replace({"ABC":60,-19:19})
df_cleaned

   one  Age
0   10   19
1   20    1
2   30   30
3   40   40
4   50   50
5   60   60

In [99]:
details = {"Brand":pd.Series(["Asus", "Nokia", "Micromax", "MI", "Vivo", "Oppo", "Moto", "Apple", "Zen", "Apple", "Nokia"]),
          "Price":pd.Series([10000, 15000, 12500, 13000, 14000, 14500, 14600, 16500, 15000]),
          "Ratings(10)":pd.Series([7,8,7.5,7.2,8,5,9,8])}

d = pd.DataFrame(details)
d

       Brand    Price  Ratings(10)
0       Asus  10000.0          7.0
1      Nokia  15000.0          8.0
2   Micromax  12500.0          7.5
3         MI  13000.0          7.2
4       Vivo  14000.0          8.0
5       Oppo  14500.0          5.0
6       Moto  14600.0          9.0
7      Apple  16500.0          8.0
8        Zen  15000.0          NaN
9      Apple      NaN          NaN
10     Nokia      NaN          NaN

In [100]:
dm = d["Price"].mean()

In [101]:
d["Ratings(10)"].mean()

7.4625

In [102]:
d["Price"].fillna(dm)

0     10000.0
1     15000.0
2     12500.0
3     13000.0
4     14000.0
5     14500.0
6     14600.0
7     16500.0
8     15000.0
9     13900.0
10    13900.0
Name: Price, dtype: float64